# Функция - фрагмент программного кода (подпрограмма) к которому можно обратиться из другого места программы
# Функции обычно имеют имя, в Python можно создавать функции без имени.
# Функции нужы: для повторного использования кода; для создания более логичной структуры программы;
# для объединения нескольких небольших действий в одно.
# print, type, range, len, input, int, float, str

# Печать - функция с параметрами
print('Hello, functions')

# Функция м.б. без параметров, но возвращает результат
name = input()

# Тип переменной - функция с параметрами и возвращаемым результатом
t = type(123)

# Диапазон - функция с параметрами и возвращаемым результатом
r = range(10)

# Длина последовательности
 #len([1,2,3])

 # Преобразование типов
 #int('10')
 #str(10)

