# Создайте функцию, принимающую на вход 3 числа и возвращающую наибольшее из них.
def get_max(a, b, c):
    resalt = max([a, b, c])
    return resalt
print(get_max(5, 81, 12))